//
//  PageModel.swift
//  What? Where? When?
//
//  Created by Macbook Air 13 on 01.02.24.
//

import Foundation

struct Page: Identifiable, Equatable {
    var id = UUID()
    var title: String
    var text: String
    var imageName: String
    var tag: Int
    
    static var onboardingPages = [
        Page(
            title: "თამაშის წესები",
            text: "თამაშში მონაწილეობას იღებს 2 გუნდი: ტელემაყურებლები და მოაზროვნეები.\n\nტელემაყურებლები მოაზროვნეებს უსვამენ კითხვებს. მოაზროვნეებს პასუხის მოსაფიქრებლად ეძლევათ ერთი წუთი.",
            imageName: "Logo",
            tag: 0
        ),
        Page(
            title: "თამაშის წესები",
            text: "თუ მოაზროვნეები სწორად პასუხობენ დასმულ კითხვას, ისინი ეუფლებიან ქულას;\n\nთუ მოაზროვნეთა პასუხი მცდარია, ქულა ერიცხება ტელემაყურებლებს.\n\nთამაში გრძელდება 6 ქულამდე.",
            imageName: "TVScreen",
            tag: 1
        ),
        Page(
            title: "თამაშის წესები",
            text: "სათამაშო მაგიდა გაყოფილია 12 სექტორად. მოაზროვნეებისთვის დასასმელ კითხვას „განსაზღვრავს“ ბზრიალას ისარი.\n\nთუ ისარი მიუთითებს იმ სექტორზე, რომელმაც უკვე ითამაშა, მოაზროვნეებს დაესმება კითხვა მომდევნო სექტორიდან, რომელიც გადაითვლება საათის ისრის მიმართულებით.",
            imageName: "GameTable",
            tag: 2
        ),
        Page(
            title: "თამაშის წესები",
            text: "მოაზროვნეებს უფლება აქვთ უპასუხონ დასმულ კითხვას წუთის გამოუყენებლად (ე.წ. „ვადამდელი პასუხი“).\n\nსისწორის შემთხვევაში მოაზროვნეები იღებენ „დამატებით წუთს“, რომლითაც შეუძლიათ ისარგებლონ მომდევნო რაუნდებში, გარდა გადამწყვეტი რაუნდისა.",
            imageName: "Stopwatch",
            tag: 3
        ),
        Page(
            title: "თამაშის წესები",
            text: "5 ქულის დაგროვების შემთხვევაში, მოაზროვნეებს ეძლევათ უფლება ითამაშონ „გადამწყვეტი რაუნდი“.\n\nამ შემთხვევაში ანგარიში ხდება 0:0. გადამწყვეტ რაუნდში სწორი პასუხი ფასდება 6 ქულით;",
            imageName: "DecidingRound",
            tag: 4
        )
    ]
}
